Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In recent years, AI has evolved from a niche technology to one of the most transformative innovations in IT. The rise of large language models has opened new opportunities for building more intelligent, personalized, and adaptive applications. Predictive and generative AI models are increasingly being integrated to provide smarter user experiences, automate decision-making, and enhance productivity. However, developing AI-infused applications is not without its challenges. These models are often non-deterministic, meaning they can produce different outputs given the same input. They can also exhibit behaviors such as hallucination, where the model generates inaccurate or nonsensical results. Furthermore, AI systems are vulnerable to intentional or accidental misuse, leading to privacy violations, security risks, or biased outcomes.
ja_jp: 近年、AI はニッチなテクノロジーから IT における最も革新的なイノベーションの 1 つへと進化しました。大規模言語モデルの台頭は、よりインテリジェントでパーソナライズされた適応性の高いアプリケーションを構築する新たな機会を開拓しました。予測 AI モデルと生成 AI モデルは、よりスマートなユーザーエクスペリエンスを提供し、意思決定を自動化し、生産性を向上させるために、ますます統合されています。しかし、AI を組み込んだアプリケーションの開発には課題がないわけではありません。これらのモデルは非決定論的であることが多く、同じ入力に対して異なる出力を生成する可能性があります。また、モデルが不正確または意味不明な結果を生成する幻覚のような挙動を示すこともあります。さらに、AI システムは意図的または偶発的な誤用に脆弱であり、プライバシー侵害、セキュリティリスク、または偏った結果につながる可能性があります。

source: In scenarios where RESTEasy Reactive is used along with Hibernate Reactive, no `@Blocking` annotation is necessary on the endpoint methods that interact with Hibernate Reactive.
ja_jp: RESTEasy Reactive が Hibernate Reactive とともに使用されるシナリオでは、Hibernate Reactive と相互作用するエンドポイントメソッドに `@Blocking` アノテーションは必要ありません。

source: In scenarios where RESTEasy Reactive is used along with Hibernate, the `@Blocking` annotation should be placed on the endpoint methods that interact with Hibernate.
ja_jp: RESTEasy Reactive が Hibernate と一緒に使用されるシナリオでは、 `@Blocking` アノテーションを Hibernate と相互作用するエンドポイントメソッドに配置する必要があります。

source: In sentence case capitalization style
ja_jp: 文例大文字スタイルでは

source: In short, Netty provides an _efficient_ memory management system for asynchronous applications. It offers different types of memory allocation strategies, including **heap** (stored in the JVM heap) and direct memory (allocated outside the JVM memory), along with a **buffer pooling mechanism** to optimize allocations and reduce garbage collection (GC) overhead.
ja_jp: 要するに、Netty は _効率的な_ メモリ管理システムを非同期アプリケーション向けに提供します。これは、**ヒープ** (JVM ヒープに保存される) や直接メモリ (JVM メモリの外部に割り当てられる) を含むさまざまな種類のメモリ割り当て戦略と、割り当てを最適化し、ガベージコレクション (GC) のオーバーヘッドを削減するための **バッファー プーリング メカニズム** を提供します。

source: In short, RESTEasy Reactive is now smart enough to choose a blocking or non blocking thread model depending on the prototype of your REST methods, which should makes things easier when you are coming from RESTEasy Classic.
ja_jp: 一言でいうと、RESTEasy Reactiveは、RESTメソッドのプロトタイプに応じて、ブロッキングまたはノンブロッキングのスレッドモデルを選択することができるようになりましたので、RESTEasy Classicからの移行が容易になります。

source: In situations where all that is needed to build a container image and no push to a registry is necessary (essentially by having set `quarkus.container-image.build=true` and left `quarkus.container-image.push` unset - it defaults to `false`), then this extension creates a container image and registers it with the Docker daemon. This means that although Docker isn't used to build the image, it is nevertheless necessary. Also note that using this mode, the built container image *will* show up when executing `docker images`.
ja_jp: 必要なことがコンテナーイメージを構築するだけで、レジストリーへのプッシュが不要な場合 (基本的には `quarkus.container-image.build=true` を設定して `quarkus.container-image.push` のままにしておくことで、デフォルトは `false` になります)、このエクステンションはコンテナーイメージを作成し、Docker デーモンに登録します。これは、Docker がイメージのビルドには使われなくても必要であることを意味します。また、このモードを使用すると、 `docker images` を実行するとコンテナーイメージが表示されます。

source: In some advanced scenarios, you can manipulate directly the stream of messages instead of each individual message.
ja_jp: 一部の高度なシナリオでは、個々のメッセージではなく、メッセージのストリームを直接操作できます。

source: In some cases it can be required that all registered authentication mechanisms create their `SecurityIdentity`. It can be required when the credentials such as tokens have to be passed over <<mutual-tls>>, for example, when users are authenticating via `Virtual Private Network`, or when the current token has to be bound to the client certificate for the token verification to succeed, guaranteeing that the token was issued exactly to the same client which is currently passing this token to Quarkus alongside its client certificate.
ja_jp: 場合によっては、登録されているすべての認証メカニズムが `SecurityIdentity` を作成することが必要になることがあります。 これは、トークンなどの認証情報を <<mutual-tls>> 経由で渡す必要がある場合に必要になることがあります。 たとえば、ユーザーが `Virtual Private Network` 経由で認証している場合や、トークンの検証を成功させるために現在のトークンをクライアント証明書にバインドして、このトークンをクライアント証明書とともに Quarkus に渡している同じクライアントにトークンが正確に発行されたことを保証する場合などです。

source: In some cases such a default logic of selecting the challenge is exactly what is required by a given application, but sometimes it may not meet the requirements. In such cases (or indeed in other similar cases where you'd like to change the order in which the mechanisms are asked to handle the current authentication or challenge request), you can create a custom mechanism and choose which mechanism should create a challenge, for example:
ja_jp: このようなデフォルトのチャレンジ選択ロジックが、あるアプリケーションでまさに必要とされる場合もありますが、時には要件を満たさない場合もあります。そのような場合（あるいは、メカニズムが現在の認証またはチャレンジ要求を処理するように求められる順序を変更したい他の同様の場合）、カスタムメカニズムを作成し、どのメカニズムがチャレンジを作成すべきかを選択することができます。 :

source: In some cases you may want to mock the remote endpoint - the HTTP server - instead of mocking the client itself. This may be especially useful for native tests, or for programmatically created clients.
ja_jp: 場合によっては、クライアント自体をモックするのではなく、リモートエンドポイント (HTTP サーバー) をモックしたい場合があります。これは、ネイティブテスト、またはプログラムで作成されたクライアントに特に役立つ場合があります。

source: In some cases, JWT bearer tokens have an `x5c` header which represents an X509 certificate chain whose leaf certificate contains a public key that must be used to verify this token's signature. Before this public key can be accepted to verify the signature, the certificate chain must be validated first. The certificate chain validation involves several steps:
ja_jp: 場合によっては、JWT ベアラートークンに `x5c` ヘッダーがあり、このヘッダーは X509 証明書チェーンを表します。この証明書チェーンのリーフ証明書には、トークンの署名の検証に使用する必要がある公開鍵が含まれています。 まず証明書チェーンを検証してから、この公開鍵を受け入れて署名を検証する必要があります。 証明書チェーンの検証にはいくつかの手順が含まれます。

source: In some cases, OIDC provider, after accepting HTTP GET requests to either discovery or UserInfo endpoints, initiates a redirect exactly to the same endpoint address while also supplying some additional cookies.
ja_jp: 場合によっては、OIDC プロバイダーが discovery または UserInfo エンドポイントへの HTTP GET リクエストを受け入れた後、追加の Cookie を提供しながら、まったく同じエンドポイントアドレスにリダイレクトを開始することがあります。

source: In some cases, both the header and the scheme may have to customized.
ja_jp: 場合によっては、ヘッダーとスキームの両方をカスタマイズする必要があります。

source: In some cases, containers need to know the host ports they're mapped to at runtime. For example, a Kafka broker needs to advertise its externally accessible address to clients.
ja_jp: 場合によっては、コンテナーは実行時にマッピングされているホストポートを知る必要があります。たとえば、Kafka ブローカーは外部からアクセス可能なアドレスをクライアントにアドバタイズする必要があります。

source: In some cases, extra work may be needed to ensure any wrapped libraries can tolerate dev mode, since the classloading is different and hot reloading can break some assumptions. Extensions may also wish to add some xref:writing-extensions.adoc#integrating-with-development-mode[special handling for dev mode]. To add automated tests which validate dev mode, you can xref:writing-extensions.adoc#testing-hot-reload[add tests which extend the `QuarkusDevModeTest`].
ja_jp: 場合によっては、ラップされたライブラリーが開発モードに対応できるように追加の作業が必要になることがあります。これは、クラスローディングの仕組みが異なり、ホットリロードによって一部の前提が崩れる可能性があるためです。エクステンションは、xref:writing-extensions.adoc#integrating-with-development-mode[Dev モード向けの特別な処理] を追加することもできます。 Dev モードを検証する自動テストを追加するには、xref:writing-extensions.adoc#testing-hot-reload[QuarkusDevModeTest を拡張するテスト] を追加できます。

source: In some cases, incoming JWT tokens have no matching verification keys at all, and they can not be introspected. These tokens only have an `x5c` claim which contains a certificate chain with a public key that can be used to verify this token's signature. For example, SCIM provisioning agents, WebAuthn systems might produce such tokens.
ja_jp: 場合によっては、入ってくる JWT トークンに一致する検証キーが全くなく、イントロスペクションもできないことがあります。これらのトークンには `x5c` クレームのみが含まれており、そこにはトークンの署名を検証するために使用できる公開鍵を含む証明書チェーンが含まれています。たとえば、SCIM プロビジョニングエージェント、WebAuthn システムがこのようなトークンを生成することがあります。

source: In some cases, it might be useful to choose a scheduler implementation used to execute a scheduled method. However, only one `Scheduler` implementation is used for all scheduled methods by default. For example, the `quarkus-quartz` extension provides an implementation that supports clustering, but it also removes the simple in-memory implementation from the game. Now, if clustering is enabled then it's not possible to define a scheduled method that would be executed locally on a single node. Nevertheless, if you set the `quarkus.scheduler.use-composite-scheduler` config property to `true` then a composite `Scheduler` is used instead. This means that multiple scheduler implementations are kept running side by side. Furthermore, it's possible to choose a specific implementation used to execute a scheduled method using `@Scheduled#executeWith()`.
ja_jp: 場合によっては、スケジュールされたメソッドを実行するために使用されるスケジューラー実装を選択すると便利な場合があります。 ただし、デフォルトでは、すべてのスケジュールされたメソッドに対して 1 つの `Scheduler` 実装のみが使用されます。 たとえば、 `quarkus-quartz` エクステンションはクラスタリングをサポートするスケジューラ実装を提供しますが、その代わりにシンプルなインメモリー実装は使用できなくなります。 そのため、クラスタリングが有効になっている場合、単一のノードでローカルに実行されるスケジュールされたメソッドを定義できません。 ただし、 `quarkus.scheduler.use-composite-scheduler` 設定プロパティーを `true` に設定すると、代わりに複合 `Scheduler` が使用されます。 つまり、複数のスケジューラー実装が並行して実行されます。 さらに、 `@Scheduled#executeWith()` を使用して、スケジュールされたメソッドの実行に使用される特定の実装を選択することもできます。

source: In some cases, it's useful to be able to modify the annotation metadata. Quarkus provides a powerful alternative to https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#process_annotated_type[`jakarta.enterprise.inject.spi.ProcessAnnotatedType`, window="_blank"] and https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bce_enhancement[`jakarta.enterprise.inject.build.compatible.spi.Enhancement`, window="_blank"]. With an `AnnotationsTransformerBuildItem` it's possible to override the annotations that exist on bean classes.
ja_jp: 場合によっては、アノテーションメタデータを変更できると便利です。 Quarkus は、 https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#process_annotated_type[`jakarta.enterprise.inject.spi.ProcessAnnotatedType`, window="_blank"] および https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html#bce_enhancement[`jakarta.enterprise.inject.build.compatible.spi.Enhancement`, window="_blank"] の強力な代替手段を提供します。 `AnnotationsTransformerBuildItem` を使用すると、Bean クラスに存在するアノテーションをオーバーライドできます。

source: In some cases, it's useful to be able to modify the metadata. Quarkus provides a powerful alternative to https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#process_annotated_type[`javax.enterprise.inject.spi.ProcessAnnotatedType`, window="_blank"]. With an `AnnotationsTransformerBuildItem` it's possible to override the annotations that exist on bean classes.
ja_jp: 場合によっては、メタデータを変更できると便利です。Quarkus は、 https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html#process_annotated_type[`javax.enterprise.inject.spi.ProcessAnnotatedType`, window="_blank"] の強力な代替手段を提供します。 `AnnotationsTransformerBuildItem` を使用すると、Bean クラスに存在するアノテーションをオーバーライドできます。

source: In some cases, this `iss` claim verification may not work. For example, if the discovered `issuer` property contains an internal HTTP/IP address while the token `iss` claim value contains an external HTTP/IP address. Or when a discovered `issuer` property contains the template tenant variable but the token `iss` claim value has the complete tenant-specific issuer value.
ja_jp: 場合によっては、この `iss` クレームの検証がうまくいかないことがあります。例えば、発見された `issuer` プロパティに内部の HTTP/IP アドレスが含まれている一方で、トークン `iss` クレーム値に外部の HTTP/IP アドレスが含まれている場合です。あるいは、発見された `issuer` プロパティにテンプレートのテナント変数が含まれているが、トークン `iss` クレーム値には完全なテナント固有の発行者の値が含まれている場合です。

source: In some cases, this `iss` claim verification might not work. For example, if the discovered `issuer` property contains an internal HTTP/IP address while the token `iss` claim value contains an external HTTP/IP address. Or when a discovered `issuer` property contains the template tenant variable, but the token `iss` claim value has the complete tenant-specific issuer value.
ja_jp: 場合によっては、この `iss` クレーム検証がうまくいかないことがあります。 たとえば、検出された `issuer` プロパティーには内部の HTTP/IP アドレスが含まれているのに、トークン `iss` クレーム値には外部の HTTP/IP アドレスが含まれている場合などです。 または、検出された `issuer` プロパティーにはテンプレートテナント変数が含まれているのに、トークン `iss` クレーム値には完全なテナント固有の発行者の値が含まれている場合などです。

source: In some cases, you may want to programmatically check whether a request is granted to access a protected resource. By injecting a `SecurityIdentity` instance in your beans, you are allowed to check permissions as follows:
ja_jp: 場合によっては、保護されたリソースにアクセスするためのリクエストが許可されているかどうかを プログラムでチェックしたいこともあるでしょう。Beanに `SecurityIdentity` インスタンスを注入することで、以下のようにパーミッションをチェックすることができます。

source: In some cases, you may want to programmatically check whether or not a request is granted to access a protected resource. By injecting a `SecurityIdentity` instance in your beans, you are allowed to check permissions as follows:
ja_jp: 場合によっては、保護されたリソースにアクセスするためのリクエストが許可されているかどうかを プログラムでチェックしたいこともあるでしょう。Beanに `SecurityIdentity` インスタンスを注入することで、以下のようにパーミッションをチェックすることができます。

source: In some cases, you may want to use `proto` files from a different project to generate gRPC stubs. To do this:
ja_jp: 場合によっては、別のプロジェクトの `proto` ファイルを使用して gRPC スタブを生成する必要があるかもしれません。 その場合は、以下を実行します。

source: In some cases, you may want to use `proto` files from a different project to generate the gRPC stubs. In this case:
ja_jp: 場合によっては、gRPC スタブを生成するために別のプロジェクトの `proto` ファイルを使いたいかもしれません。この場合は、

source: In some cases, you may want to use the https://www.keycloak.org/docs/latest/authorization_services/#_service_client_api[Keycloak Authorization Client Java API] to perform specific operations like managing resources and obtaining permissions directly from Keycloak. For that, you can inject a `AuthzClient` instance into your beans as follows:
ja_jp: 場合によっては、 link:https://www.keycloak.org/docs/latest/authorization_services/#_service_client_api[Keycloak Authorization Client Java API]を使用して、Keycloakから直接リソースの管理や権限の取得などの特定の操作を行いたいこともあるでしょう。そのためには、以下のように `AuthzClient` インスタンスをBeanに注入します。

source: In some cases, you might need to activate the request context while processing messages consumed from a broker. While using `@ActivateRequestContext` on the `@Incoming` method is an option, its lifecycle does not follow that of a Quarkus Messaging message. For incoming channels, you can enable the request scope activation with the build time property `quarkus.messaging.request-scoped.enabled=true`. This will activate the request context for each message processed by incoming channels, and close the context once the message is processed.
ja_jp: 場合によっては、ブローカーから消費されたメッセージを処理する際に、リクエストコンテキストをアクティブにする必要があるかもしれません。`@Incoming` メソッドに `@ActivateRequestContext` を使用することもオプションですが、そのライフサイクルは Quarkus Messaging メッセージのライフサイクルには従いません。着信チャネルの場合、ビルド時プロパティー `quarkus.messaging.request-scoped.enabled=true` を使用してリクエストスコープの有効化を有効にできます。これにより、着信チャネルによって処理される各メッセージに対してリクエストコンテキストがアクティブになり、メッセージが処理されるとコンテキストが閉じられます。

source: In some cases, you might see Keycloak `HTTPS required` errors that cause either Keycloak startup or communication failures.
ja_jp: 場合によっては、Keycloak の起動または通信障害の原因となる Keycloak の `HTTPS required` エラーが表示されることがあります。

source: In some other contexts you may have other parallel representations of the same information (or parts of it) such as `SecurityContext` for JAX-RS or `JsonWebToken` for JWT.
ja_jp: 他の文脈では、JAX-RSであれば `SecurityContext` 、JWTであれば `JsonWebToken` のように、同じ情報(またはその一部)を他の別の表現で表現している場合があります。

source: In some particular use cases, it can be interesting to build several artifacts of your application from the same module. A typical example is when you want to build your application with different configuration profiles.
ja_jp: いくつかの特定のユースケースでは、同じモジュールからアプリケーションのいくつかのアーティファクトをビルドすることが興味深い場合があります。典型的な例は、さまざまな設定プロファイルを使用してアプリケーションをビルドする場合です。

source: In some scenarios you may wish to associate user data with a connection to be created by a <<client-connectors,connector>>. In this case, you can set values on the connector instance prior to obtaining the connection. This is particularly useful if you need to do something when the connection is opened and the necessary context cannot be otherwise inferred.
ja_jp: いくつかのシナリオでは、<<client-connectors,コネクター>> によって作成される接続にユーザーデータを関連付けたい場合があります。この場合、接続を取得する前にコネクターインスタンスに値を設定できます。これは、接続が開かれたときに何かを実行する必要があり、必要なコンテキストをそれ以外で推測できない場合に特に役立ちます。

source: In some scenarios, it's necessary to generate additional https://kubernetes.io/docs/reference/access-authn-authz/rbac/[RBAC] resources that are used by Kubernetes to grant or limit access to other resources. For example, in our use case, we are building https://kubernetes.io/docs/concepts/extend-kubernetes/operator/#operators-in-kubernetes[a Kubernetes operator] that needs to read the list of the installed deployments. To do this, we would need to assign a service account to our operator and link this service account with a role that grants access to the Deployment resources. Let's see how to do this using the `quarkus.kubernetes.rbac` properties:
ja_jp: シナリオによっては、Kubernetes が他のリソースへのアクセスを許可または制限するために使用される追加の link:https://kubernetes.io/docs/reference/access-authn-authz/rbac/[RBAC] リソースを生成する必要があります。たとえば、今回のユースケースでは、インストールされているデプロイのリストを読む必要のある link:https://kubernetes.io/docs/concepts/extend-kubernetes/operator/#operators-in-kubernetes[Kubernetes オペレーター] を構築しています。これを行うには、オペレーターにサービスアカウントを割り当て、このサービスアカウントと Deployment リソースへのアクセスを許可するロールをリンクする必要があります。`quarkus.kubernetes.rbac` のプロパティーを使用して、この方法を確認してみましょう。

source: In some scenarios, more significant manipulation of bytecode may be needed. If bytecode recording isn't sufficient, link:https://github.com/quarkusio/gizmo/blob/main/USAGE.adoc[Gizmo] is a convenient alternative to ASM, with a higher-level API.
ja_jp: シナリオによっては、より大幅なバイトコードの操作が必要になる場合があります。バイトコードレコーディングだけでは不十分な場合、 link:https://github.com/quarkusio/gizmo/blob/main/USAGE.adoc[Gizmo] は ASM に代わる便利な選択肢であり、よりハイレベルな API を備えています。

source: In some scenarios, you might want to propagate the caller context to the message processing stage, using <<internal-channels,internal channels>>.
ja_jp: 特定のシナリオでは、<<internal-channels,内部チャネル>> を使用して、呼び出し元のコンテキストをメッセージ処理ステージに伝搬したい場合があります。

source: In some situations, built time initializations can lead to errors when building native executables. One example is when a value gets computed at build time which is forbidden to reside in the heap of the JVM that gets baked into the binary. To see this in action, add this REST resource:
ja_jp: 状況によっては、ビルド時の初期化により、ネイティブ実行可能ファイルをビルドするときにエラーが発生する可能性があります。1 つの例は、バイナリーにベイクされる JVM のヒープに存在することが禁じられている値が、ビルド時に計算される場合です。これが実際に動作することを確認するには、この REST リソースを追加してください。

source: In some situations, looking up the exact property name is impossible. For instance, when looking up a configuration that is part of a `Map`, and the property name contains a dynamic segment (the `Map` key). In this case, Quarkus relies upon each source’s list of property names. These must be converted back to their most likely dotted format for Environment Variables.
ja_jp: 状況によっては、正確なプロパティ名を検索することが不可能な場合があります。例えば、 `Map` の一部である設定プロパティを検索する場合、プロパティ名に動的セグメント（ `Map` キー）が含まれていることがあります。この場合、Quarkusは各ソースのプロパティ名のリストに依存します。これらは、環境変数に最も適したドット付き形式に変換する必要があります。

source: In some situations, looking up the exact property name is impossible. This is the case for configuration names that contain user defined path segments.
ja_jp: 状況によ っ ては、 正確なプ ロ パテ ィ 名を検索す る こ と が不可能な場合 も あ り ます。これは、ユーザー定義のパスセグメントを含む設定名の場合です。

source: In some use cases, it is convenient to use messaging patterns to transfer messages inside the same application. When you don't connect a channel to a messaging backend, i.e. a connector, everything happens internally to the application, and the streams are created by chaining methods together. Each chain is still a reactive stream and enforces the back-pressure protocol.
ja_jp: ユースケースによっては、メッセージングパターンを使用して同じアプリケーション内でメッセージを転送すると便利です。 チャネルをメッセージングバックエンド、つまりコネクターに接続しない場合は、すべてがアプリケーション内部で行われます。 そして、ストリームはメソッドを連鎖することで作成されます。 各チェーンは引き続きリアクティブストリームで、バックプレッシャープロトコルが適用されます。

source: In some use cases, it is convenient to use the messaging patterns to transfer messages inside the same application. When you don't connect a channel to a messaging backend like Kafka, everything happens in-memory, and the streams are created by chaining methods together. Each chain is still a reactive stream and enforces the back-pressure protocol.
ja_jp: ユースケースによっては、メッセージングパターンを使って同じアプリケーション内でメッセージを転送することが便利な場合があります。Kafka のようなメッセージングバックエンドにチャネルを接続しない場合、すべてがインメモリーで行われ、ストリームはメソッドをチェーンすることで作成されます。各チェーンは依然としてリアクティブストリームであり、バックプレッシャープロトコルが適用されます。

source: In some use cases, query pipelining can improve database access performance.
ja_jp: ユースケースによっては、クエリーパイプラインによってデータベースアクセスのパフォーマンスが向上する場合があります。

source: In specific code, the following two steps are required. First, implement `traceId` and `spanId` on the new event as follows The `@TraceIdRelational` and `@SpanIdRelational` attached to these events will provide the association.
ja_jp: 具体的なコードとしては、以下の2ステップが必要です。 まず、新しいイベントに `traceId` と `spanId` を次のように実装します。 これらのイベントに付けられた `@TraceIdRelational` と `@SpanIdRelational` が紐付けを行います。

source: In such a scenario, you will need to set <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-mapping-structure,`quarkus.hibernate-search-standalone.mapping.structure`>> to a value matching the structure of the primary datastore.
ja_jp: このようなシナリオでは、 <<quarkus-hibernate-search-standalone-elasticsearch_quarkus-hibernate-search-standalone-mapping-structure,`quarkus.hibernate-search-standalone.mapping.structure`>> を プライマリーデータストアの構造に一致する値に設定する必要があります。

source: In such a situation, the error you might encounter is:
ja_jp: このような状況では、以下のようなエラーが発生します。

source: In such case (if you don't want to wait for the new command to be supported in https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`]), you can implement it in either https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] or https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`]. In order to do so, you will need:
ja_jp: このような場合（新しいコマンドが link:https://github.com/vert-x3/vertx-redis-client[`vertx-redis-client`]でサポートされるのを待ちたくない場合）は、 link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`]または link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] のいずれかで実装できます。 そのためには、以下のものが必要となります。

source: In such case, you will need to deactivate that other extension too. For example see xref:hibernate-orm.adoc#persistence-unit-active[here for Hibernate ORM].
ja_jp: その場合、他のエクステンションも無効にする必要があります。 たとえば、 xref:hibernate-orm.adoc#persistence-unit-active[Hibernate ORM については、こちらを] 参照してください。
